# Дан список ["Taylor", "Alex", "Jack", "Anna"] Ваша задача: Через цикл в новом словаре dict1 записать возраст каждого спросив его у пользователя. Результат: {"Taylor":24, "Alex":14, и т.д}
# dict=["Taylor", "Alex", "Jack", "Anna"]
# dict1={}
# for i in dict:
#     dict1[i]=input('введте ваш возраст:')
#     print(dict1)
# У вас есть текст, """Вода указана для полного рецепта. Вода указана примерно, сколько пельмени могут впитать при варке. Если вы не будете варить все пельмени сразу, то воды нужно меньше (или на ваш вкус), для это рассчитайте вес пельменей и воду заново.""" Вам надо в Словарь записать буквы, которые встречаются в тексте больше 15-ти раз и его значением количество этих букв. Примерный результат: {"а":17, "о":20 и т.д}
# text="""Вода указана для полного рецепта. Вода указана примерно, сколько п
# ельмени могут впитать при варке. Если вы не будете варить все пельмени сразу, то воды
# нужно меньше (или на ваш вкус), для это рассчитайте вес пельменей и воду заново.""" 
# ltt33=['о','а','и','в','п','е','с','р']
# l33={}
# for i in ltt33:
#     if text.count(i) > 15:
#         l33[i]=text.count(i)
# print(l33)
# Спросить у пользователя четное число, если он его вводит, сказать ему спасибо, если же он ошибается, то вы должны спросить ответ на пример "6 + 9 + 6 * 9", если же он вводит неверный ответ, "отправить пользователя в третий класс", если же вводит верный ответ, поблагодарить и завершить программу.
# a = int(input("Введите четное число"))
# if a % 2==0:
#      b=int(input("6+9+6*9:"))
#      if b==69:
#           print("Красавчик!!!")
#      else:
#           print("Иди в 3-класс!")

# else:
#      print("Иди в 3-класс!")
# Пользователь вводит число, к примеру i Вам надо вывести произведение всех чисел до i на 6 (16, 26 и т.д)
# a=int(input("Введите число: "))
# count=0
# for i in range(a):
#      i=i*count[i]
#      print(count)
# Дан список ["Taylor", "Alex", "Jack", "Anna"] Ваша задача: Через цикл в новом словаре dict1 записать возраст каждого спросив его у пользователя. Результат: {"Taylor":24, "Alex":14, и т.д}
# dict=["Taylor", "Alex", "Jack", "Anna"]
# dict1={}
# for i in dict:
#     dict1[i]=input('введте ваш возраст:')
#     print(dict1)
# У вас есть текст, """Вода указана для полного рецепта. Вода указана примерно, сколько пельмени могут впитать при варке. Если вы не будете варить все пельмени сразу, то воды нужно меньше (или на ваш вкус), для это рассчитайте вес пельменей и воду заново.""" Вам надо в Словарь записать буквы, которые встречаются в тексте больше 15-ти раз и его значением количество этих букв. Примерный результат: {"а":17, "о":20 и т.д}
# text="""Вода указана для полного рецепта. Вода указана примерно, сколько п
# ельмени могут впитать при варке. Если вы не будете варить все пельмени сразу, то воды
# нужно меньше (или на ваш вкус), для это рассчитайте вес пельменей и воду заново.""" 
# ltt33=['о','а','и','в','п','е','с','р']
# l33={}
# for i in ltt33:
#     if text.count(i) > 15:
#         l33[i]=text.count(i)
# print(l33)
# Спросить у пользователя четное число, если он его вводит, сказать ему спасибо, если же он ошибается, то вы должны спросить ответ на пример "6 + 9 + 6 * 9", если же он вводит неверный ответ, "отправить пользователя в третий класс", если же вводит верный ответ, поблагодарить и завершить программу.
# a = int(input("Введите четное число"))
# if a % 2==0:
#      b=int(input("6+9+6*9:"))
#      if b==69:
#           print("Красавчик!!!")
#      else:
#           print("Иди в 3-класс!")

# else:
#      print("Иди в 3-класс!")
# Пользователь вводит число, к примеру i Вам надо вывести произведение всех чисел до i на 6 (16, 26 и т.д)
