# Problem1:
    # Найдите способ вывода следующей строки без пробелов:
    # t = 'I T C b o o t c a m p'


# Problem2:
    # Дана строка:
    # text = "YouTube — видеохостинг, предоставляющий пользователям услуги хранения, доставки и показа видео"
    # Ваша задача вывести на экран
    # Сколько символов содержит данная строка


#Problem3:
    # Дана строка:
    # text = "Функции одна из ключевых конструкций в программировании, без них невозможно сделать практически ничего"
    # Получить из text т.е. текст без пробела
    # Должно получится: (Функцииоднаизключевыхконструкцийвпрограммировании,безнихневозможносделатьпрактическиничего)

#Problem4:
    # Напишите программу которая принимает у пользователя текст (С помощью input) и при вводе  он должен вывести все буквы заглавными :


#Problem5:
# Задание
# Вам даны три перемеменные с фамилиями разных людей. Составьте и выведите на экран слово из символов в таком порядке:
 
# one = 'Musk'
# two = 'Steve'
# three = 'Gates'

# Третий символ из первой строки
# Второй символ из второй строки
# Четвертый символ из третьей строки
# Четвертый символ из второй строки
# Третий символ из второй строки

# Попробуйте использовать интерполяцию: внутри фигурных скобок можно помещать не только целые переменные, но и отдельные символы с помощью квадратных скобок.

