# a=(str(input('input yourname;')))
# print(a.title())

greg = "23" # string
helo = 14 # integer
# helo = "14"
# boolen = True # boolean
float = 4.6 # float
# print(boolen)
# print(greg+float)
# print(greg)
# print(helo)

# print(type(boolen))
# print(type(flo))
one = [1, 9]
two = [1, 9]
print(one == two)
# print(type(helo))
# print(type(a))
# 5
# print(a)
# # №2) Пользователь Вводит своё имя и Фамилию, вам надо вывести в терминал Приветственное письмо (Привет {Фамилия} {Имя}!)
# 
# b = input("input your surname:")
# print(f"Привет {a}  {b}") 
# a = input("input your number:")
# print(a+5)
















# b=int(input("input your number"))
# c=int(input("input  your number:"))
# d=int(input("input  your number:"))

# print(b+c+d)
# print(b*c*d)
# print(d/a)
# print(a**a)

# print(b**b)
# print(c**c)
# print(d**d)

# a = input("Ваше имя:")
# b = int(input("Год рождение:"))
# print(f"Добро пожаловать!  {a} ")
# print(f"Вам {2021-b} лет")

# a=int(input("input  your number:"))
# b=int(input("input your number"))
# c=int(input("input  your number:"))
# d=int(input("input  your number:"))
# e=int(input("input  your number:"))

# print(c)

# print(5+74-53*3.14//6+54)
1
# 4 Problem
# Пользователь вводит два числовых значения
# Вам надо их сравнить и вывести: 
# а) Большее из них (True, False, False)
# б) Меньшее (False, True, False)
# в) Если же они равны, (False, False, True)

# a = input("Введите число:")
# b = input("Введите число:")
# if a > b:
#          print('Большее число:', a)
# else:
#          print('Большее число:', b)

# 5 Problem
# У вас есть два числа: 5 и 7
# Пользователь вводит знак (+, -, /, *), Вы должны совершить арифметическое вычесление, тоесть, если Ползователь ввёл "+", Вы должны вывести 5 + 7 в терминал и так далее.
    

# a = (input("Введите число:")
# b = input("Введите число:")
# if   a + b:   
#     print(a + b)
# elif a / b:
#     print(a/b)


# a = 5
# b = 7
# operation = input("арифметическая операция(+, -, /, *): ")

# if operation == "+":
#     print(a+b)



# age = int(input("Жаш: "))
# if age > 18 or age == 18 :
#     print("Толтурса болот!")
# elif age < 18:
#     print("Болбойт")
# else:
#     print("Туура сан жаз!")



    # haca1 = set(sequence_0)
# if len(sequence_0) == len(haca1):
#     print("1-Последовательность уникален")
# else:
#     print("1-Не уникален")
# haca2 = set(sequence_1)
# if len(sequence_1) == len(haca2):
#     print("2-Последовательность уникален")
# else:
#     print("2-Не уникален")

# haca3 = set(sequence_2)
# if len(sequence_2) == len(haca3):
#     print("3-Последовательность уникален")
# else:
#     print("3-Не уникален")


# haca4 = set(sequence_3)
# if len(sequence_3) == len(haca4):
#     print("4-Последовательность уникален")
# else:
#     print("4-Не уникален")