#с помощью list comprehenstion операций вывести в списке нечетные числа

# lts = [1,2,3,4,5]
# lst2 =[i for i  in lts if i % 2!=0 ]
# print(lst2)


#с помощью тернарного оператора вывести сумму,произведения,разность

lts = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]

lst3 = [i for i in lts ]
#3) сделать калькулятор с выбором операция если пользователь ввел знак, который не является знаком арифметической операции то вывести сообщение о некорректном вводе необходимо проверить не является ли нулем второе число. Если это так, то сообщить о невозможности деления
# a = int(input("Ведите 1-число:"))
# znak = input("Введите знак: ")
# b = int(input("Ведите 2-число:"))

# if znak == '+':
#     с = a + b
#     print("Результат: ", a + b)
# elif znak == "-":
#     c = a + b
#     print("Результат: ", a - b)
# elif znak == "*":
#     c = a * b
#     print("Результат: ", a * b)
# elif znak == "/":
#     c = a / b
#     print("Результат: ", a / b)
# elif b !=0:
#     print("На нол делить нельзя!!!")
# else:
#     print("Выбрана неверная операция")
